MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EZR32WG230F64R69/mcu.h
/** @} End of group EZR32WG230F64R69_PRS */

/***************************************************************************//**
 * @defgroup EZR32WG230F64R69_UNLOCK EZR32WG230F64R69 Unlock Codes
 * @{
 ******************************************************************************/
#define MSC_UNLOCK_CODE      0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE      0xADE8 /**< EMU unlock code */
#define CMU_UNLOCK_CODE      0x580E /**< CMU unlock code */
#define TIMER_UNLOCK_CODE    0xCE80 /**< TIMER unlock code */
#define GPIO_UNLOCK_CODE     0xA534 /**< GPIO unlock code */
#define BURTC_UNLOCK_CODE    0xAEE8 /**< BURTC unlock code */

/** @} End of group EZR32WG230F64R69_UNLOCK */

/** @} End of group EZR32WG230F64R69_BitFields */

/***************************************************************************//**
 * @defgroup EZR32WG230F64R69_Alternate_Function EZR32WG230F64R69 Alternate Function
 * @{
 ******************************************************************************/

// #include "ezr32wg_af_ports.h"  // Note: Changed for MikroE implementation.
// #include "ezr32wg_af_pins.h"  // Note: Changed for MikroE implementation.

/** @} End of group EZR32WG230F64R69_Alternate_Function */

/***************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to up2026-05-22
 *  @param MASK
 *       The mask for the bit field to up2026-05-22
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 ******************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EZR32WG230F64R69 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif

#endif /* EZR32WG230F64R69_H */
